Project 8/app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT `notes`.* FROM `notes`

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO `notes` (`created_at`, `updated_at`) VALUES ('2013-12-11 14:39:26', '2013-12-11 14:39:26')