Project 9/app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO `videos` (`created_at`, `description`, `slug`, `title`, `updated_at`, `user_id`) VALUES ('2014-03-07 00:31:28', 'test', 'nursary-rhymes-732c1108-7f0f-40ea-95a9-960f586965f5', 'Nursary Rhymes', '2014-03-07 00:31:28', 1)

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE `videos` SET `title` = 'Scrolly Demo', `description` = 'App Demo', `video` = 'tabs_scrolly.mp4', `updated_at` = '2014-01-04 07:46:17' WHERE `videos`.`id` = 5

  def destroy
    @video.destroy
---
DELETE FROM `videos` WHERE `videos`.`id` = 1

    def set_video
      @video = Video.friendly.find(params[:id])
---
SELECT `videos`.* FROM `videos` WHERE (`videos`.`id` IS NOT NULL)