Project 2/app/controllers/events_controller.rb

SELECT `events`.* FROM `events` INNER JOIN `taggings` ON `events`.`id` = `taggings`.`event_id` WHERE `taggings`.`tag_id` = 1
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN events ON events.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Event' AND taggings.context = 'tags') AND (taggings.taggable_id IN(3,4,5)) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
   if params[:tag]
    @events = Event.tagged_with(params[:tag])
   else
    @events = Event.all

INSERT INTO `events` (`address`, `agenda`, `created_at`, `location`, `slug`, `start_date`, `start_time`, `title`, `updated_at`) VALUES ('Zhubei City', 'Ruby Meetup', '2013-08-18 01:53:37', 'Stanley\'s Steak, Hsinchu', 'hsinchu-ruby-meetup', '2013-08-18 01:51:00', '2013-08-18 01:51:00', 'Hsinchu Ruby Meetup', '2013-08-18 01:53:37')
---
  def create
    @event = current_user.organized_events.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE `events` SET `location` = 'Howard International House, Taipei, Taiwan', `agenda` = 'The AP-RASC is the Asia-Pacific regional URSI conference held between the URSI General Assemblies and Scientific Symposia. The objective of the AP-RASC is to review current research trends, present new discoveries, and make plans for future research and special projects in all areas of radio science, especially where international cooperation is desirable, and a particular emphasis is placed on promoting various research activities in the Asia-Pacific area.', `address` = 'No. 1, Section 4, Luósīfú Rd, Daan District, Taipei City, 106', `updated_at` = '2013-08-11 11:06:57' WHERE `events`.`id` = 3
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM `events` WHERE `events`.`id` = 2
---
  def destroy
    @event.destroy

SELECT `events`.* FROM `events` WHERE `events`.`id` = 16 LIMIT 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`id` = 8 LIMIT 1
UPDATE `attendances` SET `attendances`.`state` = 'accepted' WHERE `attendances`.`id` = 8
---
  def accept_request
    @event = Event.find(params[:event_id])
    @attendance = Attendance.find_by(id: params[:attendance_id]) rescue nil
    @attendance.accept!
    'Applicant Accepted' if @attendance.save

SELECT `events`.* FROM `events` WHERE `events`.`id` = 16 LIMIT 1
SELECT `attendances`.* FROM `attendances` WHERE (13)
---
  def reject_request
    @event = Event.find(params[:event_id])
    @attendance = Attendance.where(params[:attendance_id]) rescue nil

INSERT INTO `attendances` (`created_at`, `event_id`, `state`, `updated_at`, `user_id`) VALUES ('2013-08-18 07:58:17', 15, 'request_sent', '2013-08-18 07:58:17', 2)
---
  def join
    @attendance = Attendance.join_event(current_user.id, params[:event_id], 'request_sent')
    'Request Sent' if @attendance.save

SELECT `events`.* FROM `events` WHERE `events`.`id` = 980190962 LIMIT 1
---
    def set_event
      @event = Event.friendly.find(params[:id])