Project 1/app/controllers/recipes_controller.rb

SELECT `recipes`.* FROM `recipes`
---
  def index
    @recipes = Recipe.all

INSERT INTO `recipes` (`cooking_time`, `created_at`, `cuisine_id`, `food_preference_id`, `ingredients`, `level_of_difficulty`, `procedure`, `servings`, `title`, `updated_at`) VALUES (15, '2013-08-03 12:11:44', 1, 2, 'test', 'Medium', 'test', 3, 'Double Cheese Nachos', '2013-08-03 12:11:44')
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE `recipes` SET `food_preference_id` = 1, `updated_at` = '2013-08-03 12:12:03' WHERE `recipes`.`id` = 1
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

DELETE FROM `recipes` WHERE `recipes`.`id` = 1
---
  def destroy
    @recipe.destroy

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 1 LIMIT 1
---
    def set_recipe
      @recipe = Recipe.find(params[:id])

SELECT `food_preferences`.* FROM `food_preferences`
SELECT `food_types`.* FROM `food_types`
SELECT `cuisines`.* FROM `cuisines`
---
    def set_values
      @food_preferences = FoodPreference.all
      @food_types = FoodType.all
      @cuisines = Cuisine.all