Project 4/app/views/menus/show.html.erb


<% @menu.items.each do |i|%>
---
SELECT `items`.* FROM `items` WHERE `items`.`menu_id` = 1