Project 2/app/views/events/show.html.erb

  <strong>Tags:</strong>
  <%=raw @event.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %>
---
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`event_id` = 15