Project 7/app/controllers/map_display_controller.rb

  def index
    @markers = []
    if params[:place].present?
      @friends = current_user.friends.near(params[:place])
      @friends.each do |f|
---
SELECT friends.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((53.365962 - friends.latitude) * PI() / 180 / 2), 2) + COS(53.365962 * PI() / 180) * COS(friends.latitude * PI() / 180) * POWER(SIN((-0.007710999999999999 - friends.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(friends.longitude - -0.007710999999999999), RADIANS(friends.latitude - 53.365962))) + 360 AS decimal) % 360 AS bearing FROM `friends` WHERE (friends.latitude BETWEEN 53.076498433778305 AND 53.6554255662217 AND friends.longitude BETWEEN -0.49281698251809114 AND 0.4773949825180911 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((53.365962 - friends.latitude) * PI() / 180 / 2), 2) + COS(53.365962 * PI() / 180) * COS(friends.latitude * PI() / 180) * POWER(SIN((-0.007710999999999999 - friends.longitude) * PI() / 180 / 2), 2))) <= 20) ORDER BY distance ASC