Project 7/app/controllers/sessions_controller.rb

INSERT INTO `users` (`address`, `avatar`, `created_at`, `latitude`, `longitude`, `name`, `oauth_secret`, `oauth_token`, `provider`, `uid`, `updated_at`) VALUES ('Zhubei City, Taiwan', 'http://pbs.twimg.com/profile_images/3408461966/ec4861b6463a7921fe64d96537b9e50b_normal.jpeg', '2013-11-24 15:04:53', 24.8333333, 121.0119444, 'Saurabh Bhatia', 'oIx2ddTLd19vVj8i5xNYcxX6gtqlXu6WY14RFSXywDZJD', '415386785-URRXAJQSyyJ1FkJQt2eSyg4hpXajoAj6PxVpzUPI', 'twitter', '415386785', '2013-11-24 15:04:53')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '415386785' LIMIT 1
---
 def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)