Project 4/app/controllers/dashboard_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'saurabhbhatia' ORDER BY `users`.`id` ASC LIMIT 1
SELECT `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 24 ORDER BY `organizations`.`id` ASC LIMIT 1
---
  def show
     @user = User.where(:name => request.subdomain).first || not_found
     @user.organizations.each do |o|