Project 4/app/controllers/home_controller.rb

SELECT `plans`.* FROM `plans`
---
  def index
  	@plans = Plan.all.to_a