Project 4/app/controllers/menus_controller.rb

  def index
    @menus = Menu.all
---
SELECT `menus`.* FROM `menus`

  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save
---
INSERT INTO `menus` (`created_at`, `description`, `restaurant_id`, `title`, `updated_at`) VALUES ('2013-09-20 09:42:54', 'Main Course', 1, 'Food Menu', '2013-09-20 09:42:54')

    def set_menu
      @menu = Menu.find(params[:id])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1