Project 4/app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.where(:name => request.subdomain).first
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`name` = 'laboncafe' ORDER BY `organizations`.`id` ASC LIMIT 1

  def new
    @organization = Organization.new
    @plan = Plan.where(:id=> params[:plan_id]).pluck(:name)
---
SELECT `plans`.`name` FROM `plans` WHERE `plans`.`id` IS NULL

  def edit
     @organization.users.each do |u|
      if u.plan_id.present?
	@plan = Plan.where(:id=> u.plan_id).pluck(:name)
---
SELECT `users`.* FROM `users` INNER JOIN `organizations_users` ON `users`.`id` = `organizations_users`.`user_id` WHERE `organizations_users`.`organization_id` = 8
SELECT `plans`.`name` FROM `plans` WHERE `plans`.`id` = 1

  def create
    @user = current_user
    @organization = Organization.new(organization_params)
    @organization.users << @user
---
INSERT INTO `organizations` (`created_at`, `description`, `name`, `plan_id`, `updated_at`) VALUES ('2013-09-24 14:21:46', 'test', 'Safew Labs', 2, '2013-09-24 14:21:46')

  def update
    respond_to do |format|
      if @organization.update(organization_params)
---
UPDATE `organizations` SET `description` = 'French Hispitality', `updated_at` = '2013-09-30 13:16:52' WHERE `organizations`.`id` = 8

  def destroy
    @organization.destroy
---
DELETE FROM `organizations` WHERE `organizations`.`id` = 3

    def set_organization
      @organization = Organization.find(params[:id])
---
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 8 LIMIT 1