Project 4/app/controllers/restaurants_controller.rb

  def index
    @organization = current_user.organizations.first.name
    if params[:id].present?
      @restaurants = @tenant.restaurants.find(params[:id])
    else
      @restaurants = Restaurant.all
---
SELECT `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 24 ORDER BY `organizations`.`id` ASC LIMIT 1
SELECT `restaurants`.* FROM `restaurants`

  def show
    @menus = Menu.where(:restaurant_id => @restaurant.id)
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`restaurant_id` = 2

  def export_menus
    @menus = Menu.where(:restaurant_id => params[:restaurant_id])
---
SELECT `menus`.* FROM `menus`  WHERE `menus`.`restaurant_id` = 2

  def new
    @restaurant = Restaurant.new
    @organization = current_user.organizations.first.id
---
SELECT `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 25 ORDER BY `organizations`.`id` ASC LIMIT 1

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.organization_id = current_user.organizations.first.id

    respond_to do |format|
      if @restaurant.save
---
SELECT  `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 25  ORDER BY `organizations`.`id` ASC LIMIT 1
INSERT INTO `restaurants` (`created_at`, `description`, `name`, `organization_id`, `slug`, `updated_at`) VALUES ('2014-02-08 16:02:42', 'Pizza and Pasta Place', 'Sunny Lulu Pizza and Pasta', 9, 'sunny-lulu-pizza-and-pasta', '2014-02-08 16:02:42')

  def destroy
    @restaurant.destroy
---
DELETE FROM `restaurants` WHERE `restaurants`.`id` = 1

    def set_restaurant
      @restaurant = Restaurant.friendly.find(params[:id])
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 0 LIMIT 1