Project 4/app/controllers/setup_organization_controller.rb

INSERT INTO `organizations` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-09-30 03:28:38', 'French Hospitality\r\n', 'French Hospitality Inc', '2013-09-30 03:28:38')
---
   def update
     @user = current_user
     @organization = Organization.new(organization_params)
     @organization.users << @user