Project 4/app/views/layouts/_navbar.html.erb

            <li><%=link_to "#{current_user.email}" %></li>
            <li><%= link_to 'Edit Organization', edit_organization_path(current_user.organizations.first.id) %></li>
---
SELECT `organizations`.* FROM `organizations` INNER JOIN `organizations_users` ON `organizations`.`id` = `organizations_users`.`organization_id` WHERE `organizations_users`.`user_id` = 24 ORDER BY `organizations`.`id` ASC LIMIT 1