Project 8/app/controllers/api/v1/notes_controller.rb

SELECT `notes`.* FROM `notes`
---
  def index
    respond_with Note.all

SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 1 LIMIT 1
---
  def show
    respond_with Note.find(params[:id])

INSERT INTO `notes` (`body`, `category_id`, `created_at`, `title`, `updated_at`) VALUES ('body', 2, '2013-12-24 23:45:37', 'test', '2013-12-24 23:45:37')
---
  def create
   respond_with Note.create(note_params)

DELETE FROM `notes` WHERE `notes`.`id` = 4
---
  def destroy
     respond_with Note.destroy(params[:id])

SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 4 LIMIT 1
---
  def set_page
   @note = Note.find(params[:id])